#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-2-4886.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a0d0972f-7c02-4a96-9ea2-f829b5c4df6f]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2ee40dce-26eb-4e2f-9e6c-f62a93b551d0]
module.keycloak_dev.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=71a56d25-9eae-4df0-9e12-fdcb13a9043a]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c4361a63-3caa-4f6c-ace3-919d449fa6ff]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=20145990-6a3b-48d5-8c99-99733194dee5]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-2-4886.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ee7fa56e-7cda-402f-8102-65bf13e392ef]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-2-4886.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=80fa960d-ca89-4c55-a580-606bb5dd4f9f]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-2-4886.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=64fc949c-bd2e-48ab-8f9b-4ef21b701fca]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-2-4886.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a61d9f0c-848f-4fc5-8b84-b43816183b29]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-2-4886.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=c9d2ba71-f19b-4fe6-a7b1-0e2be74fc2fd]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-2-4886.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c4109449-4522-47be-b64f-e232a7102b9e]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c995a533-816a-48dd-9aa0-37e98c02bd17]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=6db7451e-825e-48d2-a4be-9bf193295ada]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6151860d-1780-4ee4-b47e-d64b09795cc7]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=163a1516-6055-4249-90cb-8a0063a6f7de]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f73e5464-501c-49d4-bf8c-2802a8360926]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=033a953a-5dd6-472c-9a5c-8d5bff6df889]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7c3e998a-8ae2-4d5d-a71e-6174d7e5f5c3]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=961942f0-5d9b-4692-a24e-6588eca82a3f]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d88c19f8-86da-4ae5-bb41-9257b272479a]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=16484d85-e7b3-4be0-8c7c-6f204a3da0eb]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2763b0dc-00a0-465a-a327-93affca5821d]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b9aab272-78e1-4cce-bae9-671b7e9dd760]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5ff9a99e-210c-4667-9612-a087313f6869]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5d4b88c0-8ce2-41ad-92f5-903bc4bcf045]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=83ab957d-9026-4268-8783-be60c70a7757]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=00ca6796-98fc-4d4a-b9fb-fcf28ed78ec3]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=96b39fd8-c1c8-42f4-bb64-b767e67e44c9]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a3b88f38-15dc-4b4a-baec-c6579630644c]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7519df91-94ee-4fb5-887f-eca9cb19fa95]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=c543e7e2-a624-44fa-a5cb-37d8b5da2cdf]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5aca37af-a5cf-4589-a5d4-500e31638bbe]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f9d3716d-da09-47ea-8673-9231e14bb31b]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=15d88449-bc0d-426e-81b0-6a4695f26aac]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b24fc842-4228-4c11-bfda-725ff2e436dd]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0a1f63c9-8b52-46e8-976c-6b475d33a12c]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=58fa0b6a-e5bc-4425-83a5-a6d702ca3276]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=375fbf7f-3bca-4849-b17a-04d632b0cea4]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=81ec1bdd-ac1e-45b5-a2a7-923c61fce091]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=38153cb0-ed55-408b-ba7f-762efedd86cb]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=bb3e060b-1097-4126-a79f-756d06016f2f]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=73a01703-e426-493a-8a55-a370969aebd1]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6f59d5e7-b118-461d-97c7-cbcba6290356]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bf1e1545-c8b8-409f-8ae5-27a075372507]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=30f18071-66dd-4d05-ab42-ca8ba6098ad0]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0d093c22-ba7c-4d85-94bc-e3430d06f4fe]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=655e1e48-72b4-45e4-ad75-0223b0e7021b]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=db295ab1-fc62-4710-b041-1a280bd674d7]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0fedc4b5-1941-4368-8c93-be590b0670f8]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3559989c-f390-416f-b178-dde31ae043eb]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3cf62cff-4c51-4df1-9c03-0747d294026c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=67d6d396-9e6a-4904-a3c9-d8f1ff697235]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5e79c1fb-5081-4b53-b637-6b42cec40c12]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cb6f72bb-4325-433a-9579-261210291fc3]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d97d4f3a-8a4c-4a1a-ad6f-0fed80f5d66c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cf92d72a-c9fa-49f5-921f-d152dc7e6ed7]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bc59ddfc-f011-43ac-bfb4-554d07506edc]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d6026de8-3eee-4aba-a5fe-96a9bcfa0826]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7ed73078-f49e-4471-b56c-5313a5e461af]
module.keycloak_dev.module.onestopauth.module.client_zz-3466.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3c7a0eaa-308f-4e2b-848b-00f281813093]
module.keycloak_dev.module.onestopauth.module.client_zz-3466.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ae6c314c-6100-427a-ac52-e8bfaa1fd6f3]
module.keycloak_dev.module.onestopauth.module.client_zz-3466.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2e698e3d-dd75-4564-ab54-a7aaff8cb959]
module.keycloak_dev.module.onestopauth.module.client_zz-3466.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a07eae3d-9aab-4fee-86d0-17356abe4114]
module.keycloak_dev.module.onestopauth.module.client_zz-3466.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2f112e1e-daa4-4f9a-b0eb-ee3ad6e335fa]
module.keycloak_dev.module.onestopauth.module.client_zz-3466.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=657c788a-03b0-4523-8829-a66deb290123]
module.keycloak_dev.module.onestopauth.module.client_zz-3466.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f52b6cb2-d69e-43f3-8cc3-7f9a049333e3]
module.keycloak_dev.module.onestopauth.module.client_zz-3466.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2885a23f-89c1-45fa-8918-291779c6a647]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bfa4e54c-a49d-4d79-8eb5-e7c3e019f67e]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=dfe2f6cc-c549-4648-94a6-d5034f4ec78a]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ba68540d-e15d-4c70-96d3-274af865a4ba]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c4d723cc-a45f-4c1e-b4dc-09c394b44904]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2dceb657-c062-4745-893b-321a5f61439d]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=54031ea8-8feb-4baf-9f01-cd0350e79c21]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=023943ea-5c9b-4169-a6b3-568c77b5638e]
module.keycloak_dev.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2622fe34-878b-42cc-8f07-643c7eec7a56]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6f1e226a-a94f-4481-86a5-3459a7628694]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=07ba0da1-dc37-450a-afb5-daef9551eb7e]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=96b9351e-8a31-49e0-b9c0-517639e7d236]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a6ae35d9-5d61-4705-ad38-c5136866a1a3]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ded15d3f-dee9-47bd-b03b-f88dbd574868]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=55bb3928-b97f-4aae-9011-faf5a92d5d7e]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2871b1e0-719a-41b0-bc7c-a4db1923c469]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=83d95a20-8363-4f99-8619-7b3991dba8d8]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8f53305-a0bd-4217-8f99-f01f7ac449e9]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3d76c8e8-1cc6-4ba3-8bc1-f10b2a0ddcb1]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=45578e11-c4be-4421-b4bf-1d0d52198a0d]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e12b99a3-70bb-45cc-934a-353bbe2a2621]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e667cf59-6571-4ade-801b-e982726167b8]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cd8fc724-320f-454f-b84a-b80913bca910]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=376b14e1-332d-473f-87d2-6840780376e6]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c05ff3c3-9d3c-4f63-9749-734267a00def]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth.module.client_feb-2-test-team-access-to-json-4918.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "3b8a90dc-f5bd-4a7f-a5cb-56a881a685ba"
        name                                     = "feb-2-test-team-access-to-json-4918"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_generic_client_protocol_mapper.access_token_aud will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      - client_id       = "c2171404-e54f-4b3d-a72b-9c0feac653be" -> null
      - config          = {
          - "access.token.claim"       = "true"
          - "id.token.claim"           = "false"
          - "included.client.audience" = "123-3532"
        } -> null
      - id              = "318be919-3068-4e8e-9dd6-ea9d693ab986" -> null
      - name            = "access_token_aud" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-audience-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      - client_id       = "c2171404-e54f-4b3d-a72b-9c0feac653be" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_guid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_guid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "0ed923e7-f0ab-4404-97d9-21446ca5c257" -> null
      - name            = "bceid_business_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      - client_id       = "c2171404-e54f-4b3d-a72b-9c0feac653be" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_name"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_name"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "0ee28783-8137-4078-9b5b-7f48ffa74eed" -> null
      - name            = "bceid_business_name" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      - client_id       = "c2171404-e54f-4b3d-a72b-9c0feac653be" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "60b40eec-6f42-4a6e-9da3-5cadcc6a51c8" -> null
      - name            = "bceid_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_generic_client_protocol_mapper.client_roles_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      - client_id       = "c2171404-e54f-4b3d-a72b-9c0feac653be" -> null
      - config          = {
          - "access.token.claim"                   = "true"
          - "claim.name"                           = "client_roles"
          - "id.token.claim"                       = "true"
          - "jsonType.label"                       = "String"
          - "multivalued"                          = "true"
          - "userinfo.token.claim"                 = "true"
          - "usermodel.clientRoleMapping.clientId" = "123-3532"
        } -> null
      - id              = "0b20f1ae-7cd2-4c82-b29a-19a595c7e7b3" -> null
      - name            = "client_roles" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-client-role-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      - client_id       = "c2171404-e54f-4b3d-a72b-9c0feac653be" -> null
      - config          = {
          - "access.token.claim"         = "true"
          - "access.tokenResponse.claim" = "false"
          - "claim.name"                 = "identity_provider"
          - "id.token.claim"             = "true"
          - "jsonType.label"             = "String"
          - "user.session.note"          = "identity_provider"
        } -> null
      - id              = "1e4ba049-9676-4b74-9bdd-1017998516d0" -> null
      - name            = "IDP" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usersessionmodel-note-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      - client_id       = "c2171404-e54f-4b3d-a72b-9c0feac653be" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_guid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_guid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "bad85f8b-1172-4b45-ad94-4ae2b86b760b" -> null
      - name            = "idir_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      - client_id       = "c2171404-e54f-4b3d-a72b-9c0feac653be" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "8e261e3c-dc6d-4fba-98a5-3562c01860ca" -> null
      - name            = "idir_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_openid_client.this will be destroyed
  - resource "keycloak_openid_client" "this" {
      - access_type                              = "PUBLIC" -> null
      - client_id                                = "123-3532" -> null
      - client_secret                            = (sensitive value)
      - consent_required                         = false -> null
      - description                              = "CSS App Created" -> null
      - direct_access_grants_enabled             = false -> null
      - enabled                                  = true -> null
      - exclude_session_state_from_auth_response = false -> null
      - full_scope_allowed                       = false -> null
      - id                                       = "c2171404-e54f-4b3d-a72b-9c0feac653be" -> null
      - implicit_flow_enabled                    = false -> null
      - name                                     = "123-3532" -> null
      - pkce_code_challenge_method               = "S256" -> null
      - realm_id                                 = "onestopauth" -> null
      - service_accounts_enabled                 = false -> null
      - standard_flow_enabled                    = true -> null
      - valid_redirect_uris                      = [
          - "http://localhost:3000",
        ] -> null
      - web_origins                              = [
          - "+",
        ] -> null
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "feb-3-test-team-access-to-files-4951"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "feb-3-test-team-access-to-files-4951"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://www.test.ca",
        ]
      + web_origins                              = [
          + "+",
          + "http://www.test.ca",
        ]
    }

Plan: 9 to add, 0 to change, 9 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3438 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*